In [117]:
person = {"first":"vaishnavi",
          "last":"rayal",
          "email":"vvaishu2001@gmail.com"}

In [118]:
ppl = {"first": ["vaishnavi"],
       "last": ["rayal"],
       "email":["vvaishu2001@gmail.com"]}

In [119]:
people = {"first":["vaishnavi","janhvi","sariga"],
         "last":["rayal","jeevan","triveni"],
         "email":["vvaishu2001@gmail.com",
                  "janhvijeevan19@gmail.com",
                  "sariga23@gmail.com"]}

In [120]:
people["email"]

['vvaishu2001@gmail.com', 'janhvijeevan19@gmail.com', 'sariga23@gmail.com']

In [121]:
import pandas as pd

In [122]:
df= pd.DataFrame(people)

In [123]:
df

       first     last                     email
0  vaishnavi    rayal     vvaishu2001@gmail.com
1     janhvi   jeevan  janhvijeevan19@gmail.com
2     sariga  triveni        sariga23@gmail.com

In [124]:
df["email"]

0       vvaishu2001@gmail.com
1    janhvijeevan19@gmail.com
2          sariga23@gmail.com
Name: email, dtype: object

In [125]:
df.email

0       vvaishu2001@gmail.com
1    janhvijeevan19@gmail.com
2          sariga23@gmail.com
Name: email, dtype: object

In [126]:
df[['last','email']]

      last                     email
0    rayal     vvaishu2001@gmail.com
1   jeevan  janhvijeevan19@gmail.com
2  triveni        sariga23@gmail.com

In [127]:
df.iloc[[0,1],2]

0       vvaishu2001@gmail.com
1    janhvijeevan19@gmail.com
Name: email, dtype: object

In [128]:
df.loc[[0,1],['first','last']]

       first    last
0  vaishnavi   rayal
1     janhvi  jeevan

In [129]:
df.set_index('email', inplace=True)

In [130]:
df

                              first     last
email
vvaishu2001@gmail.com     vaishnavi    rayal
janhvijeevan19@gmail.com     janhvi   jeevan
sariga23@gmail.com           sariga  triveni

In [131]:
df.index

Index(['vvaishu2001@gmail.com', 'janhvijeevan19@gmail.com',
       'sariga23@gmail.com'],
      dtype='object', name='email')

In [132]:
df.loc['vvaishu2001@gmail.com']

first    vaishnavi
last         rayal
Name: vvaishu2001@gmail.com, dtype: object

In [133]:
df.loc['vvaishu2001@gmail.com','last']

'rayal'

In [134]:
df.reset_index('email', inplace=True)

In [135]:
df

                      email      first     last
0     vvaishu2001@gmail.com  vaishnavi    rayal
1  janhvijeevan19@gmail.com     janhvi   jeevan
2        sariga23@gmail.com     sariga  triveni

In [136]:
df.loc[0]

email    vvaishu2001@gmail.com
first                vaishnavi
last                     rayal
Name: 0, dtype: object

In [137]:
df.iloc[0]

email    vvaishu2001@gmail.com
first                vaishnavi
last                     rayal
Name: 0, dtype: object

In [138]:
df

                      email      first     last
0     vvaishu2001@gmail.com  vaishnavi    rayal
1  janhvijeevan19@gmail.com     janhvi   jeevan
2        sariga23@gmail.com     sariga  triveni

In [139]:
df['last']== 'jeevan'

0    False
1     True
2    False
Name: last, dtype: bool

In [140]:
filt = df['last']== 'jeevan' #filter mask

In [141]:
df[filt]   #returns the details whose last name is jeevan

                      email   first    last
1  janhvijeevan19@gmail.com  janhvi  jeevan

In [142]:
df.loc[filt]

                      email   first    last
1  janhvijeevan19@gmail.com  janhvi  jeevan

In [143]:
df.loc[filt,'email']  #for the last name=jeevan

1    janhvijeevan19@gmail.com
Name: email, dtype: object

In [144]:
filtr = (df['last']== 'jeevan' ) & (df['first']=='janhvi')

In [145]:
df[filtr]

                      email   first    last
1  janhvijeevan19@gmail.com  janhvi  jeevan

In [146]:
filtr1 = (df['last']== 'jeevan' ) | (df['first']=='sariga')

In [147]:
df[filtr1]

                      email   first     last
1  janhvijeevan19@gmail.com  janhvi   jeevan
2        sariga23@gmail.com  sariga  triveni

In [148]:
df[-filtr1]

                   email      first   last
0  vvaishu2001@gmail.com  vaishnavi  rayal

In [149]:
df.loc[-filtr1]

                   email      first   last
0  vvaishu2001@gmail.com  vaishnavi  rayal

In [150]:
df.loc[-filtr1,'email']

0    vvaishu2001@gmail.com
Name: email, dtype: object

In [151]:
# df[-filter, 'last'] will throw an error
#thats why we use 'loc'

In [152]:
#-------update data within rows and columns------

In [153]:
df

                      email      first     last
0     vvaishu2001@gmail.com  vaishnavi    rayal
1  janhvijeevan19@gmail.com     janhvi   jeevan
2        sariga23@gmail.com     sariga  triveni

In [154]:
df.columns

Index(['email', 'first', 'last'], dtype='object')

In [155]:
df.columns= ['email','first_name','last_name']

In [156]:
df.columns

Index(['email', 'first_name', 'last_name'], dtype='object')

In [157]:
df

                      email first_name last_name
0     vvaishu2001@gmail.com  vaishnavi     rayal
1  janhvijeevan19@gmail.com     janhvi    jeevan
2        sariga23@gmail.com     sariga   triveni

In [158]:
df.columns=[x.upper() for x in df.columns]
df

                      EMAIL FIRST_NAME LAST_NAME
0     vvaishu2001@gmail.com  vaishnavi     rayal
1  janhvijeevan19@gmail.com     janhvi    jeevan
2        sariga23@gmail.com     sariga   triveni

In [159]:
df.columns= df.columns.str.replace('_',' ')
#replacing underscore with space
df

                      EMAIL FIRST NAME LAST NAME
0     vvaishu2001@gmail.com  vaishnavi     rayal
1  janhvijeevan19@gmail.com     janhvi    jeevan
2        sariga23@gmail.com     sariga   triveni

In [160]:
df.columns=[x.lower() for x in df.columns]
df

                      email first name last name
0     vvaishu2001@gmail.com  vaishnavi     rayal
1  janhvijeevan19@gmail.com     janhvi    jeevan
2        sariga23@gmail.com     sariga   triveni

In [161]:
#rename
df.rename(columns={'first name': 'first','last name': 'last'}, inplace=True)
df

                      email      first     last
0     vvaishu2001@gmail.com  vaishnavi    rayal
1  janhvijeevan19@gmail.com     janhvi   jeevan
2        sariga23@gmail.com     sariga  triveni

In [162]:
df.loc[2]

email    sariga23@gmail.com
first                sariga
last                triveni
Name: 2, dtype: object

In [163]:
df.loc[2]= ['sariga23@gmail.com','sariga','vishnu']

In [164]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu

In [165]:
df.loc[3] = ['JohnSmith@email.com', 'john','smith']

In [166]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3       JohnSmith@email.com       john   smith

In [167]:
df.loc[3, ['last', 'email']] = ['Doe', 'JohnDoe@email.com']

In [168]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         JohnDoe@email.com       john     Doe

In [169]:
df.loc[3, 'last'] = 'Smith'

In [170]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         JohnDoe@email.com       john   Smith

In [171]:
filtr1=(df['email']=='JohnDoe@email.com')
df[filtr1]['last']

3    Smith
Name: last, dtype: object

In [172]:
df[filtr1]['last']='Doe'

<ipython-input-172-df104bca3f5c>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[filtr1]['last']='Doe'

In [173]:
df[filtr1]

               email first   last
3  JohnDoe@email.com  john  Smith

In [174]:
df.loc[filtr1,'last']='Doe'

In [175]:
df[filtr1]

               email first last
3  JohnDoe@email.com  john  Doe

In [176]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         JohnDoe@email.com       john     Doe

In [177]:
#hence changed from smith to doe

In [178]:
df['first'].str.upper()

0    VAISHNAVI
1       JANHVI
2       SARIGA
3         JOHN
Name: first, dtype: object

In [179]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         JohnDoe@email.com       john     Doe

In [180]:
#no change in the main table.

In [181]:
df['first']=df['first'].str.upper()

In [182]:
df

                      email      first    last
0     vvaishu2001@gmail.com  VAISHNAVI   rayal
1  janhvijeevan19@gmail.com     JANHVI  jeevan
2        sariga23@gmail.com     SARIGA  vishnu
3         JohnDoe@email.com       JOHN     Doe

In [183]:
#now this has changed the first name to capslock

In [184]:
df['first']=df['first'].str.lower()
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         JohnDoe@email.com       john     Doe

In [188]:
#we use 4 methods to do this
#1.apply
#2.map
#3.applymap
#4.replace

In [189]:
#-----> 1.apply
# we use it for updating and finding length

In [190]:
df['first'].apply(len)
#this specifies the length of the each word in the "first" column

0    9
1    6
2    6
3    4
Name: first, dtype: int64

In [191]:
def update_email(email):  #python function in order to update
    return email.upper()

In [192]:
df['email']= df['email'].apply(update_email)
df

                      email      first    last
0     VVAISHU2001@GMAIL.COM  vaishnavi   rayal
1  JANHVIJEEVAN19@GMAIL.COM     janhvi  jeevan
2        SARIGA23@GMAIL.COM     sariga  vishnu
3         JOHNDOE@EMAIL.COM       john     Doe

In [193]:
#in order to change it back to lower case...
#we use lambda function
df['email']= df['email'].apply(lambda x: x.lower())
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         johndoe@email.com       john     Doe

In [194]:
df.apply(len)  #give the length of eachseries in dataframe
#by default, it calculates by rows

email    4
first    4
last     4
dtype: int64

In [195]:
df.apply(len, axis='columns')

0    3
1    3
2    3
3    3
dtype: int64

In [196]:
len(df['email'])

4

In [197]:
df.apply(pd.Series.min)
#alphabetical order

email    janhvijeevan19@gmail.com
first                      janhvi
last                          Doe
dtype: object

In [198]:
df.apply(pd.Series.max) #aplhabetical order with max value

email    vvaishu2001@gmail.com
first                vaishnavi
last                    vishnu
dtype: object

In [199]:
df.apply(lambda x: x.min())

email    janhvijeevan19@gmail.com
first                      janhvi
last                          Doe
dtype: object

In [200]:
#----->applymap

In [201]:
df.applymap(len) #it gives for both rows and columns as a whole

   email  first  last
0     21      9     5
1     24      6     6
2     18      6     6
3     17      4     3

In [202]:
df.applymap(str.lower)

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         johndoe@email.com       john     doe

In [203]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         johndoe@email.com       john     Doe

In [204]:
df=df.applymap(str.lower)
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         johndoe@email.com       john     doe

In [205]:
#----->map

In [206]:
df['first'].map({'john':'jonh','sariga':'sarigha'})

#we use ({})
#we can alter any no.of.names

0        NaN
1        NaN
2    sarigha
3       jonh
Name: first, dtype: object

In [207]:
df['first'] = df['first'].replace({'jonh': 'john', 'sarigha': 'sariga'})

In [209]:
df

                      email      first    last
0     vvaishu2001@gmail.com  vaishnavi   rayal
1  janhvijeevan19@gmail.com     janhvi  jeevan
2        sariga23@gmail.com     sariga  vishnu
3         johndoe@email.com       john     doe